Repository: Techniki-RTF/FoodWizardAIBot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: ru

source: Hello, {name}! Menu:
ru: Привет, {name}! Меню:

source: Send an image
ru: Отправьте изображение

source: Developer: t.me/renamq Team: Techniki
ru: Разработчик: t.me/renamq Команда: Техники

source: Your goal: {goal}
ru: Ваша цель: {goal}

source: Your sex: {sex}
ru: Ваш пол: {sex}

source: Your current parameters: {height} cm / {weight} kg / {age} years
ru: Ваши текущие параметры: {height} см / {weight} кг / {age} лет

source: Your Body Mass Index (BMI): {bmi}
ru: Ваш индекс массы тела: {bmi}

source: Your daily calorie allowance considering your activity level ({activity}): {daily_kcal}
ru: Ваша дневная норма калорий с учётом вашей активности ({activity}): {daily_kcal}

source: no data
ru: нет данных

source: Select your goal:
ru: Выберите цель:

source: Select your sex:
ru: Выберите пол:

source: You have selected: {sex}
ru: Вы выбрали {sex} пол

source: Select a parameter to change its value
ru: Выберите параметр для изменения его значения

source: You have chosen {goal} as your goal
ru: Вы выбрали {goal} в качестве цели

source: Send the parameter value in the format: {param_format}
ru: Отправьте значение параметра в формате {param_format}

source: Select your activity level:
ru: Выберите ваш уровень активности:

source: Please complete your profile and calculate your daily calorie allowance before using this feature.
ru: Заполните профиль и рассчитайте вашу суточную норму калорий перед использованием этой функции.

source: Specify any dietary preferences, if you have them. Examples: desserts with meals, vegetarian diet, citrus intolerance. If you have no special preferences, type "None".
ru: Укажите особые предпочтения в вашем рационе, если они есть Примеры: десерты в приёмах пищи, вегетарианская диета, непереносимость цитрусовых Если у вас нет особых предпочтений, напишите "Нет".

source: Which dish would you like a recipe for?
ru: Для какого блюда найти рецепт?

source: Searching for a recipe...
ru: Поиск рецепта в процессе.

source: An unexpected API error occurred. Please try again.
ru: Произошла непредвиденная ошибка на стороне API, попробуйте ещё раз.

source: Failed to find a recipe. Please try again.
ru: Не удалось найти рецепт, попробуйте ещё раз.

source: 📊 Nutritional value (per 100g):
ru: 📊 Пищевая ценность (на 100г):

source: 🔸 Calories: {calories} kcal
ru: 🔸 Калории: {calories} ккал

source: 🔸 Protein: {protein}g
ru: 🔸 Белки: {protein}г

source: 🔸 Fats: {fats}g
ru: 🔸 Жиры: {fats}г

source: 🔸 Carbohydrates: {carbs}g
ru: 🔸 Углеводы: {carbs}г

source: 📝 Ingredients:
ru: 📝 Ингредиенты:

source: 👨‍🍳 Preparation method:
ru: 👨‍🍳 Способ приготовления:

source: Specify which ingredients you'd like to replace with lower-calorie alternatives. For example: "replace butter, sour cream, and sugar" or "all ingredients".
ru: Укажите, какие ингредиенты вы хотели бы заменить на более низкокалорийные альтернативы. Например: "заменить масло, сметану и сахар" или "все ингредиенты".

source: Recipe search cancelled.
ru: Поиск рецепта отменен.

source: Alternative search cancelled.
ru: Поиск альтернатив отменен.

source: Insufficient data. Please complete your profile.
ru: Недостаточно данных. Заполните профиль, пожалуйста.

source: Your daily calorie allowance: {bmr} kcal{goal_info}
ru: Ваша суточная норма калорий: {bmr} ккал{goal_info}

source: Considering your goal ({goal}): {bmr} kcal
ru: С учётом вашей цели ({goal}): {bmr} ккал

source: Recognizing...
ru: Распознавание в процессе...

source: Could not recognize food in the photo. Please try another image.
ru: Не удалось распознать еду на фото, попробуйте другое изображение.

source: An unexpected error occurred. Please try again.
ru: Произошла непредвиденная ошибка, попробуйте ещё раз.

source: Dish name: {dish_name}
ru: Название блюда: {dish_name}

source: Weight: {dish_weight}g
ru: Вес: {dish_weight}г

source: Calories (100g): {dish_calories_per_100g} kcal
ru: Калории (100г): {dish_calories_per_100g} ккал

source: Calories ({dish_weight}g): {dish_total_calories} kcal
ru: Калории ({dish_weight}г): {dish_total_calories} ккал

source: PFC (100g): {pfc_per_100g}
ru: БЖУ (100г): {pfc_per_100g}

source: PFC ({dish_weight}g): {pfc_per_total}
ru: БЖУ ({dish_weight}г): {pfc_per_total}

source: Invalid data input format ({text})
ru: Неверный формат ввода данных ({text})

source: Parameter set successfully!
ru: Параметр успешно установлен!

source: not specified
ru: не указан

source: User data ({datetime}):
ru: Данные пользователей ({datetime}):

source: Creating a meal plan for {daily_kcal} kcal/day...
ru: План питания на {daily_kcal} ккал в день создаётся...

source: Text too long. Please specify preferences within 100 characters.
ru: Слишком длинный текст. Пожалуйста, укажите предпочтения не более 100 символов.

source: Failed to create a meal plan. Please try again.
ru: Не удалось составить план питания, попробуйте ещё раз.

source: 🍽️ Weekly meal plan ({daily_kcal} kcal/day)
ru: 🍽️ План питания на неделю ({daily_kcal} ккал/день)

source: 📝 Considering preferences: {preferences}
ru: 📝 С учетом предпочтений: {preferences}

source: 📅 {day_name} (P: {day_proteins}g, F: {day_fats}g, C: {day_carbs}g, {day_calories} kcal)
ru: 📅 {day_name} (Б: {day_proteins}г, Ж: {day_fats}г, У: {day_carbs}г, {day_calories} ккал)

source: 🍳 Breakfast: {breakfast_dish}
ru: 🍳 Завтрак: {breakfast_dish}

source: P: {breakfast_proteins}g, F: {breakfast_fats}g, C: {breakfast_carbs}g, {breakfast_calories} kcal
ru: Б: {breakfast_proteins}г, Ж: {breakfast_fats}г, У: {breakfast_carbs}г, {breakfast_calories} ккал

source: 🥗 Lunch: {lunch_dish}
ru: 🥗 Обед: {lunch_dish}

source: P: {lunch_proteins}g, F: {lunch_fats}g, C: {lunch_carbs}g, {lunch_calories} kcal
ru: Б: {lunch_proteins}г, Ж: {lunch_fats}г, У: {lunch_carbs}г, {lunch_calories} ккал

source: 🍲 Dinner: {dinner_dish}
ru: 🍲 Ужин: {dinner_dish}

source: P: {dinner_proteins}g, F: {dinner_fats}g, C: {dinner_carbs}g, {dinner_calories} kcal
ru: Б: {dinner_proteins}г, Ж: {dinner_fats}г, У: {dinner_carbs}г, {dinner_calories} ккал

source: Comments from the neural network: {commentary}
ru: Комментарии от нейросети: {commentary}

source: Text too long. Please list ingredients within 100 characters.
ru: Слишком длинный текст. Пожалуйста, укажите ингредиенты не более 100 символов.

source: Searching for low-calorie alternatives...
ru: Поиск низкокалорийных альтернатив в процессе...

source: 🔄 Low-calorie alternatives for ingredients:
ru: 🔄 Низкокалорийные альтернативы для ингредиентов:

source: Calories: {calories} kcal instead of {calories_old} kcal (-{cal_diff} kcal, -{cal_percent}%)
ru: Калории: {calories} ккал вместо {calories_old} ккал (-{cal_diff} ккал, -{cal_percent}%)

source: PFC difference (per 100g): P: {protein}g, F: {fats}g, C: {carbs}g
ru: БЖУ разница (на 100г): Б: {protein}г, Ж: {fats}г, У: {carbs}г

source: Send Image
ru: Отправить изображение

source: Profile
ru: Профиль

source: Calculate Daily Calorie Allowance
ru: Рассчитать суточную норму калорий

source: Create Weekly Meal Plan
ru: Составить недельный рацион

source: About Bot
ru: О боте

source: Send New Image
ru: Отправить новое изображение

source: Find Low-Calorie Recipe
ru: Найти низкокалорийный рецепт

source: Find Low-Calorie Food Alternatives
ru: Найти низкокалорийные альтернативы продуктам

source: Main Menu
ru: Главное меню

source: To Main Menu
ru: На главную

source: Change Goal
ru: Изменить цель

source: Change Sex
ru: Изменить пол

source: Change Personal Parameters
ru: Изменить личные параметры

source: Weight Loss
ru: Похудение

source: Weight Maintenance
ru: Поддержание веса

source: Mass Gain
ru: Набор массы

source: Back
ru: Назад

source: Male
ru: Мужской

source: Female
ru: Женский

source: Change Height
ru: Изменить рост

source: Change Weight
ru: Изменить вес

source: Change Age
ru: Изменить возраст

source: Russian
ru: Русский

source: No activity
ru: Отсутствие активности

source: Light (physical activity 1-3 times a week)
ru: Лёгкая (физ. нагрузки 1-3 раза в неделю)

source: Moderate (physical activity 3-5 times a week)
ru: Средняя (физ. нагрузки 3-5 раз в неделю)

source: High (physical activity 6-7 times a week)
ru: Высокая (физ. нагрузки 6-7 раз в неделю)

source: Very high (constant physical activity)
ru: Очень высокая (постоянная физ. нагрузка)

source: Light activity
ru: Лёгкая активность

source: Moderate activity
ru: Средняя активность

source: High activity
ru: Высокая активность

source: Very high activity
ru: Очень высокая активность

source: Set other parameters
ru: Задать остальные параметры

source: Try Again
ru: Попробовать снова

source: Cancel
ru: Отмена

source: Change language
ru: Изменить язык

source: Recommended for your BMI
ru: Рекомендовано при вашем ИМТ

source: Underweight
ru: Недостаточный вес

source: Normal weight
ru: Нормальный вес

source: Overweight
ru: Избыточный вес

source: Obesity
ru: Ожирение

source: For your BMI {bmi} the recommended goal is
ru: При вашем ИМТ {bmi} рекомендуемая цель -

source: 181.5 (cm)
ru: 181.5 (см)

source: 54.2 (kg)
ru: 54.2 (кг)

source: 19 (years)
ru: 19 (лет)
